CREATE TABLE emps(
    emp_id integer NOT NULL,
    emp_name varchar(100) NOT NULL,
    dept_id integer,
    dept_name varchar(30),
    str_id integer,
    str_name varchar(50),
    salary integer
);
SELECT * from emps;
DROP TABLE emps;

INSERT INTO emps (emp_id, emp_name, dept_id, dept_name, str_id, str_name, salary) VALUES (54, 'Тихонов Евгений Викторович', 10, 'PMD-161', 4, 'Autumn - 161 (P)', '100000'),
(56, 'Щепотина Кристина Олеговна', NULL, NULL, 4, 'Autumn - 161 (P)', '100000'),
(57, 'Бочарова Светлана Владимировна', 10, 'PMD-161', 4, 'Autumn - 161 (P)', '50000'),
(60, 'Карагизова Айгерим Газизовна', 10, 'PMD-161', 4, 'Autumn - 161 (P)', '80000'),
(62, 'Воронина Ксения Анатольевна', 10, 'PMD-161', 4, 'Autumn - 161 (P)', '65000'),
(63, 'Климова Наталья Викторовна', NULL, NULL, 4, 'Autumn - 161 (P)', '120000'),
(102, 'Мадияр Аида Аянкызы', 10, 'PMD-161', 4, 'Autumn - 161 (P)', '110000'),
(170, 'Махинько Сергей Ефимович', 10, 'PMD-161', 4, 'Autumn - 161 (P)', '100000'),
(176, 'Мордвинцев Станислав Андреевич', 10, 'PMD-161', 4, 'Autumn - 161 (P)', '100000'),
(177, 'Марат Нуржан Кайратулы', 10, 'PMD-161', 4, 'Autumn - 161 (P)', '100000'),
(14, 'Рсалдин Ермухаммет Елубаевич', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '100000'),
(19, 'Каримов Марат Саттарович ', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '100000'),
(24, 'Асан Султангали Даулеткалиулы', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '100000'),
(27, 'Чукуев Олжас Серикович', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '100000'),
(28, 'Абикенов Мадияр Жанатович', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '100000'),
(31, 'Файницкий Василий Васильевич ', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '100000'),
(38, 'Ахматов Мадамин Махмудович', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '100000'),
(42, 'Марамыгин Денис Юрьевич', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '100000'),
(48, 'Ордашева Айзат Хабиденкызы', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '150000'),
(50, 'Шаханова Салтанат Кайратовна', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '150000'),
(53, 'Сыздыков Рустем Мухамедкалиевич', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '150000'),
(58, 'Шершнева Марина Анатольевна', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '150000'),
(59, 'Таганова Светлана Александровна', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '150000'),
(61, 'Сулейменова Айдана Ирановна', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '150000'),
(64, 'Попкова Камила Васильевна', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '150000'),
(65, 'Рыстина Динара Даулетбековна', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '150000'),
(70, 'Турсынхан Темирлан Саадатулы', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '150000'),
(72, 'Есебаев Болат', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '150000'),
(77, 'Ким Олег Григорьевич', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '150000'),
(80, 'Жакимов Бахтияр Манатович', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '150000'),
(84, 'Укашанов Кайрат Акылжанович ', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '200000'),
(93, 'Даукараев Нурсултан Турлыбекович', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '200000'),
(98, 'Рысқалиқызы Гульден', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '200000'),
(156, 'Игибаев Санжар Берикович', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '200000'),
(160, 'Добровольская Олеся Игоревна ', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '200000'),
(161, 'Ким Георгий Сергеевич ', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '200000'),
(179, 'Мурзахметов Асылбек Каиржанович', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '200000'),
(183, 'Щелупанов Максим Вадимович', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '200000'),
(190, 'Тлеукабыл Нурлан Абайулы', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '80000'),
(197, 'Байшев Сергей Николаевич', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '80000'),
(200, 'Билак Эдуард Викторович', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '80000'),
(242, 'Котляров Валерий Алексеевич', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '80000'),
(277, 'Омельяненко Павел Александрович', 21, 'Академ-161', 4, 'Autumn - 161 (P)', '80000'),
(6, 'Елубай Санжар Бейбытулы', 69, 'PEN-161', 4, 'Autumn - 161 (P)', '80000'),
(13, 'Мухтаров Алишер Омирзакулы', 69, 'PEN-161', 4, 'Autumn - 161 (P)', '80000'),
(18, 'Дронов Александр Сергеевич ', 69, 'PEN-161', 4, 'Autumn - 161 (P)', '80000'),
(21, 'Сарсенов Валихан Умирбаевич ', 69, 'PEN-161', 4, 'Autumn - 161 (P)', '120000'),
(23, 'Кифель Дмитрий Станиславович ', 69, 'PEN-161', 4, 'Autumn - 161 (P)', '120000'),
(33, 'Смаилов Ардак Айтказиевич', 69, 'PEN-161', 4, 'Autumn - 161 (P)', '250000'),
(46, 'Жармагамбетов Жанайдар Саятович ', 69, 'PEN-161', 4, 'Autumn - 161 (P)', '120000'),
(74, 'Мухтаров Даниель Жандилович', 69, 'PEN-161', 4, 'Autumn - 161 (P)', '240000'),
(76, 'Касиенов Казыбек Муратулы', 69, 'PEN-161', 4, 'Autumn - 161 (P)', '300000'),
(88, 'Айбасов Куат Сырымович ', 69, 'PEN-161', 4, 'Autumn - 161 (P)', '300000'),
(91, 'Орлов Александр Валерьевич', 69, 'PEN-161', 4, 'Autumn - 161 (P)', '220000'),
(5, 'Заманбек Ернияз Махмудулы ', 70, 'PEP-161', 4, 'Autumn - 161 (P)', '120000'),
(9, 'Рязанцев Евгений Вадимович', 70, 'PEP-161', 4, 'Autumn - 161 (P)', '120000'),
(10, 'Козловский Андрей Владимирович', 70, 'PEP-161', 4, 'Autumn - 161 (P)', '120000'),
(12, 'Абаев Салим Маликович', 70, 'PEP-161', 4, 'Autumn - 161 (P)', '88000'),
(16, 'Мамалинов Адилбек Аметрашитович ', 70, 'PEP-161', 4, 'Autumn - 161 (P)', '88000'),
(17, 'Ажибай Серыболат Ахметжанулы', 70, 'PEP-161', 4, 'Autumn - 161 (P)', '88000'),
(30, 'Эм Антон Юрьевич', 70, 'PEP-161', 4, 'Autumn - 161 (P)', '88000'),
(37, 'Муханов Алибек Кабдолдаевич', 70, 'PEP-161', 4, 'Autumn - 161 (P)', '88000'),
(43, 'Нусупбеков Улан Бекболатович ', 70, 'PEP-161', 4, 'Autumn - 161 (P)', '88000'),
(185, 'Касылкасова Камила Нуралиевна', 70, 'PEP-161', 4, 'Autumn - 161 (P)', '88000'),
(407, 'Кифель Дмитрий Станиславович', 70, 'PEP-161', 4, 'Autumn - 161 (P)', '88000'),
(39, 'Туркенов Айдар ', 71, 'PEP-161', 4, 'Autumn - 161 (P)', '88000'),
(40, 'Чернышев Феликс Олегович ', 71, 'PEP-161', 4, 'Autumn - 161 (P)', '88000'),
(41, 'Герман Алексей Алексеевич', 71, 'PEP-161', 4, 'Autumn - 161 (P)', '88000'),
(45, 'Мурзахметов Абдулла Каиржанулы', 71, 'PEP-161', 4, 'Autumn - 161 (P)', '60000'),
(47, 'Жунусов Жалгас Аскарович', 71, 'PEP-161', 4, 'Autumn - 161 (P)', '60000'),
(97, 'Смагулова Камила Жумартовна', 6, 'SED-161', 3, 'Autumn - 161 (S)', '60000'),
(100, 'Какенова Азиза Данияровна ', 6, 'SED-161', 3, 'Autumn - 161 (S)', '60000'),
(101, 'Ягуткин Виталий Викторович', 6, 'SED-161', 3, 'Autumn - 161 (S)', '60000'),
(172, 'Рубцов Дмитрий Владимирович', 6, 'SED-161', 3, 'Autumn - 161 (S)', '60000'),
(201, 'Шарапова Валерия Владимировна', 6, 'SED-161', 3, 'Autumn - 161 (S)', '60000'),
(7, 'Демиятова Динара', NULL, NULL, 3, 'Autumn - 161 (S)', '60000'),
(11, 'Шершнев Александр Алексеевич', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '60000'),
(20, 'Ким Анна Валерьевна', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '60000'),
(22, 'Смагулов Берлибай Берикулы', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '60000'),
(26, 'Зималева Анастасия Денисовна ', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '60000'),
(29, 'Жалнина Вероника Владимировна', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '60000'),
(32, 'Шайдаров Думан Багланулы', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '60000'),
(35, 'Винокуров Максим Владимирович', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '60000'),
(36, 'Феоктистов Александр Сергеевич', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '60000'),
(44, 'Елемесова Динара Муратовна', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '60000'),
(49, 'Бойку Юлия Александровна', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '65000'),
(51, 'Черемисина Анастасия Дмитриевна', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '65000'),
(55, 'Кусаинов Олег Разакович', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '65000'),
(66, 'Абдикен Анель Сериккызы', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '65000'),
(67, 'Орлова Оксана Владимировна ', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '65000'),
(71, 'Рощук Анастасия Сергеевна ', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '65000'),
(75, 'Жумадилов Айдын Галымович', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '65000'),
(79, 'Ахматов Хатам Махмудович', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '75000'),
(83, 'Әбдірәсіл Нұржанат Нұраханұлы ', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '75000'),
(92, 'Сексембаева Мадина Талгатовна', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '75000'),
(94, 'Гнидин Денис Анатольевич', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '75000'),
(99, 'Нурсеитов Таир Жаксыбаевич', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '75000'),
(105, 'Кайсаров Алихан Маратович', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '75000'),
(122, 'Такенова Дана Нуржановна ', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '75000'),
(147, 'Датумян Давит Арменович ', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '75000'),
(150, 'Игибаева Алуа Бериковна', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '75000'),
(151, 'Сухачев Владимир Денисович ', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '90000'),
(159, 'Объедков Даниил Грегорьевич ', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '90000'),
(165, 'Джамамбаева Рената Сагатовна ', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '90000'),
(171, 'Дуйсенбеков Бекбол Даулетович', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '90000'),
(175, 'Кручинкин Владислав Андреевич', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '90000'),
(181, 'Мельниченко Артур Михайлович', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '90000'),
(182, 'Студенников Евгений Викторович', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '90000'),
(184, 'Юматова Валерия Анатольевна', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '90000'),
(188, 'Серик Айжан Амангельдыкызы', 20, 'Отчисление -161', 3, 'Autumn - 161 (S)', '90000'),
(103, 'Максименко Никита Витальевич ', 12, 'SA12m-161', 5, 'Autumn - 161 (SA)', '185000'),
(104, 'Чурилов Александр Владимирович ', 12, 'SA12m-161', 5, 'Autumn - 161 (SA)', '185000'),
(106, 'Ерастов Никита Михайлович', 12, 'SA12m-161', 5, 'Autumn - 161 (SA)', '185000'),
(107, 'Султанов Дамир Аргынович', 12, 'SA12m-161', 5, 'Autumn - 161 (SA)', '185000'),
(108, 'Забурдяев Глеб Алексеевич', 12, 'SA12m-161', 5, 'Autumn - 161 (SA)', '185000'),
(109, 'Кочегин Кирилл Сергеевич', 12, 'SA12m-161', 5, 'Autumn - 161 (SA)', '185000'),
(127, 'Разыков Асадбек Шухратович ', 13, 'SA12e-161', 5, 'Autumn - 161 (SA)', '185000'),
(128, 'Борисов Владислав Евгеньевич ', 13, 'SA12e-161', 5, 'Autumn - 161 (SA)', '185000'),
(132, 'Кручинкин Владислав Андреевич', 13, 'SA12e-161', 5, 'Autumn - 161 (SA)', '185000'),
(111, 'Кайрат Саламат Асхатулы', 14, 'SA14m-161', 5, 'Autumn - 161 (SA)', '185000'),
(112, 'Боганов Ростислав Евгеньевич ', 14, 'SA14m-161', 5, 'Autumn - 161 (SA)', '185000'),
(113, 'Шайхстанов Данияр Куатович ', 14, 'SA14m-161', 5, 'Autumn - 161 (SA)', '185000'),
(114, 'Фахрутдинов Ильдар Наильевич ', 14, 'SA14m-161', 5, 'Autumn - 161 (SA)', '185000'),
(115, 'Агубаев Нариман Ерланович ', 14, 'SA14m-161', 5, 'Autumn - 161 (SA)', '185000'),
(116, 'Муслимов Арман Русланович', 14, 'SA14m-161', 5, 'Autumn - 161 (SA)', '185000'),
(117, 'Булаткина Татьяна Владимировна', 14, 'SA14m-161', 5, 'Autumn - 161 (SA)', '185000'),
(118, 'Бровкин Яков Александрович', 14, 'SA14m-161', 5, 'Autumn - 161 (SA)', '185000'),
(119, 'Забурдяев Никита Сергеевич', 14, 'SA14m-161', 5, 'Autumn - 161 (SA)', '185000'),
(120, 'Бердибеков Заур Бакирович', 14, 'SA14m-161', 5, 'Autumn - 161 (SA)', '185000'),
(121, 'Фомин Данил Владиславович', 14, 'SA14m-161', 5, 'Autumn - 161 (SA)', '185000'),
(123, 'Вампилов Михаил Алексеевич', 14, 'SA14m-161', 5, 'Autumn - 161 (SA)', '185000'),
(124, 'Эргашева Анеля Бозорбоевна ', 14, 'SA14m-161', 5, 'Autumn - 161 (SA)', '185000'),
(125, 'Отто Дмитрий Алексеевич ', 14, 'SA14m-161', 5, 'Autumn - 161 (SA)', '185000'),
(126, 'Зулхарнай Рустем Русланович ', 14, 'SA14m-161', 5, 'Autumn - 161 (SA)', '185000'),
(110, 'Кайрат Аружан Асхаткызы', 15, 'SA14e-161', 5, 'Autumn - 161 (SA)', '185000'),
(129, 'Чурилова Анастасия Владимировна ', 15, 'SA14e-161', 5, 'Autumn - 161 (SA)', '185000'),
(130, 'Жанабергенов Магзум Отегенулы', 15, 'SA14e-161', 5, 'Autumn - 161 (SA)', '185000'),
(131, 'Тишкин Егор Леонидович', 15, 'SA14e-161', 5, 'Autumn - 161 (SA)', '185000'),
(133, 'Ахмалтдинов Тимур Ришатович', 15, 'SA14e-161', 5, 'Autumn - 161 (SA)', '185000'),
(189, 'Горбунов Андрей Сергеевич', 15, 'SA14e-161', 5, 'Autumn - 161 (SA)', '185000'),
(194, 'Абикеев Алан Рустамович', 15, 'SA14e-161', 5, 'Autumn - 161 (SA)', '185000'),
(142, 'Баскаков Алексей Валерьевич ', 16, 'Sun12m-161', 6, 'Autumn - 161 (Sun)', '140000'),
(152, 'Ким Софья Георгиевна ', 16, 'Sun12m-161', 6, 'Autumn - 161 (Sun)', '140000'),
(153, 'Касьянов Александр Андреевич ', 16, 'Sun12m-161', 6, 'Autumn - 161 (Sun)', '140000'),
(154, 'Стрижакова Ангелина Евгеньевна ', 16, 'Sun12m-161', 6, 'Autumn - 161 (Sun)', '140000'),
(155, 'Дьяков Игорь Дмитриевич ', 16, 'Sun12m-161', 6, 'Autumn - 161 (Sun)', '140000'),
(180, 'Филатов Вячеслав Владиславович', 16, 'Sun12m-161', 6, 'Autumn - 161 (Sun)', '140000'),
(199, 'Шарипов Даниял Дарханович', 16, 'Sun12m-161', 6, 'Autumn - 161 (Sun)', '140000'),
(157, 'Салыков Константин Маратович ', 17, 'Sun12e-161', 6, 'Autumn - 161 (Sun)', '160000'),
(158, 'Ранерт Даниэль Витальевич ', 17, 'Sun12e-161', 6, 'Autumn - 161 (Sun)', '160000'),
(135, 'Алдан Асанали Аманжолович', 18, 'Sun14m-161', 6, 'Autumn - 161 (Sun)', '350000'),
(136, 'Абраменков Сергей Денисович', 18, 'Sun14m-161', 6, 'Autumn - 161 (Sun)', '350000'),
(137, 'Абеуов Тимур Ринатович', 18, 'Sun14m-161', 6, 'Autumn - 161 (Sun)', '350000'),
(138, 'Востриков Михаил Николаевич', 18, 'Sun14m-161', 6, 'Autumn - 161 (Sun)', '350000'),
(139, 'Рыбаков Иван Николаевич ', 18, 'Sun14m-161', 6, 'Autumn - 161 (Sun)', '350000'),
(140, 'Сергеев Артем Петрович ', 18, 'Sun14m-161', 6, 'Autumn - 161 (Sun)', '350000'),
(141, 'Ахметов Адиль Даниярович ', 18, 'Sun14m-161', 6, 'Autumn - 161 (Sun)', '350000'),
(143, 'Ли Диннур Александрович ', 18, 'Sun14m-161', 6, 'Autumn - 161 (Sun)', '350000'),
(144, 'Торбаев Дархан Кайратович ', 18, 'Sun14m-161', 6, 'Autumn - 161 (Sun)', '350000'),
(145, 'Шиманский Алексей Дмитриевич', 18, 'Sun14m-161', 6, 'Autumn - 161 (Sun)', '350000'),
(146, 'Альтаир Нурали', 18, 'Sun14m-161', 6, 'Autumn - 161 (Sun)', '350000'),
(148, 'Датумян Ани Арменовна ', 18, 'Sun14m-161', 6, 'Autumn - 161 (Sun)', '350000'),
(191, 'Пак Виталий Константинович', 18, 'Sun14m-161', 6, 'Autumn - 161 (Sun)', '350000'),
(162, 'Гайратов Ахтам Ришатулы', 19, 'Sun14e-161', 6, 'Autumn - 161 (Sun)', '45000'),
(163, 'Безкоровайный Кирилл Сергеевич ', 19, 'Sun14e-161', 6, 'Autumn - 161 (Sun)', '45000'),
(164, 'Середа Илья Сергеевич ', 19, 'Sun14e-161', 6, 'Autumn - 161 (Sun)', '45000'),
(166, 'Амандыков Асыл Арманович', 19, 'Sun14e-161', 6, 'Autumn - 161 (Sun)', '45000'),
(167, 'Кикимов Даниил Ержанович ', 19, 'Sun14e-161', 6, 'Autumn - 161 (Sun)', '45000'),
(173, 'Жолдасов Таир Русланович', 19, 'Sun14e-161', 6, 'Autumn - 161 (Sun)', '45000'),
(174, 'Есебаев Бекмурат Мухитулы', 19, 'Sun14e-161', 6, 'Autumn - 161 (Sun)', '45000'),
(186, 'Михайлов Александр Вадимович', 19, 'Sun14e-161', 6, 'Autumn - 161 (Sun)', '45000'),
(187, 'Айтжанов Санжар Мылтыкбаевич', 19, 'Sun14e-161', 6, 'Autumn - 161 (Sun)', '45000'),
(195, 'Королев Маским Витальевич', 19, 'Sun14e-161', 6, 'Autumn - 161 (Sun)', '45000'),
(312, 'Морозов Никита Юрьевич', 75, 'PMB-171/1', 16, 'Spring - 171 (P)', '230000'),
(315, 'Оспан Айхан Жамбылұлы', 75, 'PMB-171/1', 16, 'Spring - 171 (P)', '230000'),
(319, 'Загретдинов Дамир Рустамович', 75, 'PMB-171/1', 16, 'Spring - 171 (P)', '230000'),
(322, 'Пятчиц Марина Евгеньевна', 75, 'PMB-171/1', 16, 'Spring - 171 (P)', '230000'),
(325, 'Кудрявцев Эдвард Владиславович', 75, 'PMB-171/1', 16, 'Spring - 171 (P)', '230000'),
(329, 'Ержанұлы Ислам', 75, 'PMB-171/1', 16, 'Spring - 171 (P)', '230000'),
(330, 'Астафьева Ольга Юрьевна', 75, 'PMB-171/1', 16, 'Spring - 171 (P)', '230000'),
(331, 'Ешмаханов Ильяс Ондашевич', 75, 'PMB-171/1', 16, 'Spring - 171 (P)', '230000'),
(333, 'Ғалым Әділет', 75, 'PMB-171/1', 16, 'Spring - 171 (P)', '230000'),
(334, 'Кобелев Олег Валерьевич', 75, 'PMB-171/1', 16, 'Spring - 171 (P)', '230000'),
(336, 'Садвакасова Алия Кобызовна', 75, 'PMB-171/1', 16, 'Spring - 171 (P)', '230000'),
(395, 'Кан Лаврентий Лабрентиевич', 75, 'PMB-171/1', 16, 'Spring - 171 (P)', '230000'),
(422, 'Генш Юрий Игоревич', 75, 'PMB-171/1', 16, 'Spring - 171 (P)', '230000'),
(286, 'Сайфулина Камиля Филадовна', 76, 'PMB-171/2', 16, 'Spring - 171 (P)', '255000'),
(337, 'Садвакасов Абдуадиль Кобызович', 76, 'PMB-171/2', 16, 'Spring - 171 (P)', '255000'),
(339, 'Ларин Артём Николаевич', 76, 'PMB-171/2', 16, 'Spring - 171 (P)', '255000'),
(350, 'Ахметшин Руслан Маратович', 76, 'PMB-171/2', 16, 'Spring - 171 (P)', '255000'),
(355, 'Нұрділәұлы Нурлан', 76, 'PMB-171/2', 16, 'Spring - 171 (P)', '255000'),
(361, 'Жайтуганов Евгений Генетулаевич', 76, 'PMB-171/2', 16, 'Spring - 171 (P)', '255000'),
(392, 'Дзюбенко Артём Игоревич', 76, 'PMB-171/2', 16, 'Spring - 171 (P)', '255000'),
(403, 'Стахарнов Ярослав Владимирович', 76, 'PMB-171/2', 16, 'Spring - 171 (P)', '255000'),
(409, 'Пискунов Денис Игоревич', 76, 'PMB-171/2', 16, 'Spring - 171 (P)', '255000'),
(412, 'Почевалов Александр Валерьевич', 76, 'PMB-171/2', 16, 'Spring - 171 (P)', '255000'),
(415, 'Акылбеков Еркебулан Сагдатович', 76, 'PMB-171/2', 16, 'Spring - 171 (P)', '255000'),
(418, 'Викторов Александр Владимирович', 76, 'PMB-171/2', 16, 'Spring - 171 (P)', '255000'),
(419, 'Викторова Анастасия Александровна', 76, 'PMB-171/2', 16, 'Spring - 171 (P)', '255000'),
(282, 'Ильин Павел Петрович', 77, 'PEB- 171', 16, 'Spring - 171 (P)', '290000'),
(289, 'Феофилактов Станислав Алексеевич', 77, 'PEB- 171', 16, 'Spring - 171 (P)', '290000'),
(293, 'Ахатов Даулет Бахытович', 77, 'PEB- 171', 16, 'Spring - 171 (P)', '290000'),
(298, 'Муравьев Дмитрий Владимирович', 77, 'PEB- 171', 16, 'Spring - 171 (P)', '290000'),
(299, 'Паньков Александр Константинович', 77, 'PEB- 171', 16, 'Spring - 171 (P)', '290000'),
(327, 'Былков Георгий Владимирович', 77, 'PEB- 171', 16, 'Spring - 171 (P)', '290000'),
(332, 'Абильдин Ерлан Сакенович', 77, 'PEB- 171', 16, 'Spring - 171 (P)', '290000'),
(338, 'Пчелинцев Виталий Геннадьевич', 77, 'PEB- 171', 16, 'Spring - 171 (P)', '290000'),
(341, 'Левицкий Владимир Александрович', 77, 'PEB- 171', 16, 'Spring - 171 (P)', '290000'),
(343, 'Мутшаль Сергей Николаевич', 77, 'PEB- 171', 16, 'Spring - 171 (P)', '290000'),
(417, 'Дюсеков Болат Какенович', 77, 'PEB- 171', 16, 'Spring - 171 (P)', '290000'),
(547, 'Тусупбеков Дарын Ержанович', 77, 'PEB- 171', 16, 'Spring - 171 (P)', '290000'),
(278, 'Никифорова Светлана Андреевна', 78, 'PMD- 171', 16, 'Spring - 171 (P)', '290000'),
(295, 'Журавлева Анастасия Александровна', 78, 'PMD- 171', 16, 'Spring - 171 (P)', '290000'),
(297, 'Брусенко Елизавета Владимировна', 78, 'PMD- 171', 16, 'Spring - 171 (P)', '290000'),
(311, 'Роля Екатерина Юрьевна', 78, 'PMD- 171', 16, 'Spring - 171 (P)', '290000'),
(313, 'Шаповалова Дарья Алексеевна', 78, 'PMD- 171', 16, 'Spring - 171 (P)', '290000'),
(316, 'Голубева Наталья Владимировна', 78, 'PMD- 171', 16, 'Spring - 171 (P)', '290000'),
(323, 'Жузбаев Ерсұлтан Жасұланұлы', 78, 'PMD- 171', 16, 'Spring - 171 (P)', '290000'),
(370, 'Мусина Асем Кайратовна', 78, 'PMD- 171', 16, 'Spring - 171 (P)', '290000'),
(396, 'Канат Данара Саламатовна', 78, 'PMD- 171', 16, 'Spring - 171 (P)', '290000'),
(300, 'Пуценко Никита Александрович', 79, 'PED- 171', 16, 'Spring - 171 (P)', '290000'),
(308, 'Золотухин Василий Игоревич', 79, 'PED- 171', 16, 'Spring - 171 (P)', '290000'),
(388, 'Аринова Айдана Бекболовна', 79, 'PED- 171', 16, 'Spring - 171 (P)', '290000'),
(401, 'Жученко Оксана Александровна', 79, 'PED- 171', 16, 'Spring - 171 (P)', '290000'),
(416, 'Казанцева Алина Викторовна', 79, 'PED- 171', 16, 'Spring - 171 (P)', '290000'),
(420, 'Сафарова Валерия Николаевна', 79, 'PED- 171', 16, 'Spring - 171 (P)', '290000'),
(205, 'Карымбаев Шынгыс Санжарович', 23, 'SA12m-171', 10, 'Spring - 171 (SA)', '276000'),
(206, 'Кропачев Артем Андреевич', 23, 'SA12m-171', 10, 'Spring - 171 (SA)', '276000'),
(207, 'Шпрингер Артем Владимирович', 23, 'SA12m-171', 10, 'Spring - 171 (SA)', '276000'),
(208, 'Танирберген Ерназар Асығатұлы', 23, 'SA12m-171', 10, 'Spring - 171 (SA)', '276000'),
(209, 'Воронов Алексей Александрович', 23, 'SA12m-171', 10, 'Spring - 171 (SA)', '276000'),
(210, 'Жиркова Софья Валентиновна', 23, 'SA12m-171', 10, 'Spring - 171 (SA)', '276000'),
(211, 'Черников Никита Александрович', 23, 'SA12m-171', 10, 'Spring - 171 (SA)', '276000'),
(227, 'Беккер Александр', 23, 'SA12m-171', 10, 'Spring - 171 (SA)', '276000'),
(260, 'Какжанов Темирлан', 23, 'SA12m-171', 10, 'Spring - 171 (SA)', '276000'),
(268, 'Катков Артём Олегович', 23, 'SA12m-171', 10, 'Spring - 171 (SA)', '276000'),
(202, 'Галеева Камила Кенесовна', 24, 'SA12e-171', 10, 'Spring - 171 (SA)', '330000'),
(204, 'Медетбекова Аружан Сериковна', 24, 'SA12e-171', 10, 'Spring - 171 (SA)', '330000'),
(225, 'Анциферов Максим', 24, 'SA12e-171', 10, 'Spring - 171 (SA)', '330000'),
(226, 'Ерханұлы Иманжүсіп', 24, 'SA12e-171', 10, 'Spring - 171 (SA)', '330000'),
(272, 'Кенисарин Ерасыл Шынтасулы', 24, 'SA12e-171', 10, 'Spring - 171 (SA)', '330000'),
(217, 'Момунов Бакыт Кайратович', 25, 'SA14m-171', 10, 'Spring - 171 (SA)', '430000'),
(218, 'Кожемякин Данил Васильевич', 25, 'SA14m-171', 10, 'Spring - 171 (SA)', '430000'),
(219, 'Слепушкин Святослав Павлович', 25, 'SA14m-171', 10, 'Spring - 171 (SA)', '430000'),
(220, 'Дарманкулов Рахман Куатович', 25, 'SA14m-171', 10, 'Spring - 171 (SA)', '430000'),
(221, 'Сеилханов Аргын Аскарович', 25, 'SA14m-171', 10, 'Spring - 171 (SA)', '430000'),
(222, 'Зибатқалиев Нұрмұхамед Нұрболұлы', 25, 'SA14m-171', 10, 'Spring - 171 (SA)', '430000'),
(223, 'Петрищев Никита Иванович', 25, 'SA14m-171', 10, 'Spring - 171 (SA)', '430000'),
(224, 'Толубаев Мади Маулютканович', 25, 'SA14m-171', 10, 'Spring - 171 (SA)', '430000'),
(257, 'Маженов Ануар Бауржанович', NULL, NULL, 10, 'Spring - 171 (SA)', '430000'),
(266, 'Павловский Максим Владиславович', 25, 'SA14m-171', 10, 'Spring - 171 (SA)', '430000'),
(269, 'Пикалов Марк Владимирович', 25, 'SA14m-171', 10, 'Spring - 171 (SA)', '430000'),
(213, 'Әділов Темірлан Досбалұлы', 26, 'SA14e-171', 10, 'Spring - 171 (SA)', '360000'),
(214, 'Лапкин Игнатий Сергеевич', 26, 'SA14e-171', 10, 'Spring - 171 (SA)', '360000'),
(215, 'Рахимжанова Айганым Ардаковна', 26, 'SA14e-171', 10, 'Spring - 171 (SA)', '360000'),
(255, 'Шмидт Артем Антонович', 26, 'SA14e-171', 10, 'Spring - 171 (SA)', '360000'),
(256, 'Сыздыков Диас Нурланович', 26, 'SA14e-171', 10, 'Spring - 171 (SA)', '360000'),
(270, 'Хватов Дмитрий Васильевич', 26, 'SA14e-171', 10, 'Spring - 171 (SA)', '360000'),
(271, 'Киндсфатер Даниил Викторович', 26, 'SA14e-171', 10, 'Spring - 171 (SA)', '360000'),
(304, 'Ким Сергей Сергеевич', 26, 'SA14e-171', 10, 'Spring - 171 (SA)', '360000');

select * from emps;
-- Exercise 3
INSERT INTO emps(emp_id,emp_name,dept_id,dept_name,str_id,str_name,salary) VALUES (25,'Герман Алексей Алексеевич',68,'PEP-161',3,'Autumn - 161 (S)',430000),
                                                                                  (68, 'Жунусов Жалгас Аскарович', 68, 'PEP-161', 3,'Autumn - 161 (S)',400000),
                                                                                  (73, 'Мурзахметов Абдулла Каиржанулы', 68, 'PEP-161', 3, 'Autumn - 161 (S)',420000),
                                                                                  (78, 'Туркенов Айдар', 68, 'PEP-161', 3, 'Autumn - 161 (S)', 440000),
                                                                                  (82, 'Козловский Андрей Владимирович', 68, 'PEP-161', 3, 'Autumn - 161 (S)', 450000),
                                                                                  (85, 'Мамалинов Адилбек Ахметрашитович', 68, 'PEP-161', 3, 'Autumn - 161 (S)', 435000),
                                                                                  (87, 'Минасипова Бибигуль Саламатовна', 68, 'PEP-161', 3, 'Autumn - 161 (S)', 480000),
                                                                                  (89, 'Муханов Алибек Кабдолдаевич', 68, 'PEP-161', 3,'Autumn - 161 (S)', 490000),
                                                                                  (90, 'Нусупбеков Улан Бекболатович', 68, 'PEP-161', 3,'Autumn - 161 (S)', 465000),
                                                                                  (95, 'Эм Антон Юрьевич', 68, 'PEP-161', 3, 'Autumn - 161 (S)', 450000);

-- 4
SELECT emp_name,dept_name,salary
FROM emps
WHERE salary BETWEEN 400001 AND 600000;

--5
SELECT emp_name,salary
FROM emps
WHERE emp_name LIKE 'Б%';
--6
SELECT emp_name,salary
FROM emps
WHERE emp_name LIKE '%а' AND salary > 100000;

--7 ??? Empty result?
SELECT salary
FROM emps
WHERE dept_id = 20 and salary > 100000;

-- 8 ??? ASK!
SELECT *
FROM emps
WHERE dept_id NOT IN (69,21,33);

-- 9 ???
DELETE FROM emps
WHERE salary < 100000 and dept_id = 23;

-- 10
UPDATE emps
SET salary = salary * 1.2
WHERE dept_name LIKE '%PEP-161%';

-- 11 Снизить заработную плату сотрудникам на 50%, которые работают в потоке номер 3;

UPDATE emps
SET salary = salary * 0.5
WHERE str_id = 3;

-- 12
SELECT *
FROM emps
WHERE dept_id = 26;

-- 13
SELECT *
FROM emps
WHERE (salary NOT BETWEEN 200000 AND 400000) OR (dept_name = 'SA14m-171');

-- 14

SELECT *
FROM emps
WHERE emp_name LIKE 'Б__ч%';

-- 15
SELECT *
FROM emps
WHERE emp_name LIKE '%ич';

-- 16
SELECT *
FROM emps
WHERE emp_id % 2 = 0;

-- 17
SELECT *
FROM emps
WHERE dept_id IS NULL OR dept_name IS NULL;